import pandas as pd
data=[[45,65,200],[89,69,42],[58,74,39]]
index=['张三','李四','王五']
col=['语文','数学','英语']
s=pd.DataFrame(data=data,index=index,columns=col)
print(s)
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print('---------------------------------------------------------修改列索引')
print('---------------1 直接使用 columns属性')
s.columns=['chinese','math','english']
print(s)
#     chinese  math  english
# 张三       45    65      200
# 李四       89    69       42
# 王五       58    74       39
print('---------------2   使用 rename方法')
s.rename({'chinese':'语文','math':'数学','english':'英语'},inplace=True,axis=1)
print(s)
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print('---------------------------------------------------------修改行索引')
print('---------------1 直接使用 index属性')
s.index=['小明','小虎','小狗']
print(s)
print('---------------2   使用 rename方法')
s.rename({'小明':'张三','小虎':'李四','小狗':'王五'},inplace=True,axis=0)
print(s)
print('----------------------------------------------------------修改数据内容')
print('-------------------------修改一整行')
s.loc['张三']=[10,10,10]
print(s)
#    语文  数学  英语
# 张三  10  10  10
# 李四  89  69  42
# 王五  58  74  39
s.iloc[0,:]=[108,108,108]
print(s)
#      语文   数学   英语
# 张三  108  108  108
# 李四   89   69   42
# 王五   58   74   39
print('-------------------------修改一整列')
s['数学']=[0,0,0]
print(s)
#      语文  数学   英语
# 张三  108   0  108
# 李四   89   0   42
# 王五   58   0   39
s.loc[:,'数学']=[100,100,100]
print(s)
#      语文   数学   英语
# 张三  108  100  108
# 李四   89  100   42
# 王五   58  100   39
s.iloc[:,1]=18
print(s)
print('-------------------------修改某一处')
s.loc['李四','语文']=80
print(s)
s.iloc[1,0]=8
print(s)






























