import pandas as pd
s=pd.DataFrame(data={
    '产品名称':['电脑','手机','键盘','鼠标','手机','键盘','鼠标','电脑'],
    '成交额':[4100,1000,100,100,800,200,50,3000],
    '成交量':[10,30,45,60,10,70,80,20]
    })
print(s)
print('---------------------------------------------------------单列分组数据的迭代')
s1=s.groupby('产品名称')
for name,group in s1:
    print(name)
    print(group)
    print('-------------------------')
print('---------------------------------------------------------多列分组数据的迭代')
s2=pd.DataFrame(data={
    '产品名称':['电脑','手机','键盘','鼠标','手机','键盘','鼠标','电脑'],
    '销售员':['张三','李四','张三','王五','李四','王五','王五','李四'],
    '成交额':[4100,1000,100,100,800,200,50,3000],
    '成交量':[10,30,45,60,10,70,80,20]
    })
s3=s2.groupby(['产品名称','销售员'])
for (n1,n2),group in s3:
    print(n1,n2)
    print(group)
    print('-------------------------')
































