import pandas as pd
pd.set_option('display.width',1000)
pd.set_option('display.max_columns',500)
# print在console line下服务,这个显示基本上只能满足基本需求(这是在pycharm上运行的结果,但是在ipython上运行却可以)
s=pd.DataFrame(data=[['李明玉','15974201351','陕西省 西安市 长安中路888号西安音东学院教研中心'],
                     ['张凤香','13993355162','河北省 唐山市 乐亭县财富大街990号'],
                     ['王红军','15850914728','上海市 浦东新区 快乐路867快乐城市1111号8808室'],
                     ['牛霸','13599745669','河北省 唐山市 开发区喜庆道100号'],
                     ['马明','15018711991','台湾省 台北市 开发区经济路101号'],
                     ['昊尹明','18194186347','辽宁省 抚顺市 顺城区太重阳北路1号楼2单元606'],
                     ['欧阳丽','15857069909','山东省 临沂市 河东区正阳北路国科石油分公司'],
                     ['佐成明','13288835858','山西省 大同市 城区吉安里']],columns=['客户','手机号','地址'])
print('---------------------------------------------------------一列变多列')
new_s=s['地址'].str.split(' ',expand=True)
# print(new_s)
s['省']=new_s[0]
s['市']=new_s[1]
s['区']=new_s[2]
print(s)
print('---------------------------------------------------------一列变多列 元组数据进行分割')
df=pd.DataFrame(data={
    'a':[1,2,3,4,5],
    'b':[(1,1),(2,2),(3,3),(4,4),(5,5)]
})
print(df)
print('-------------------------')
df[['b1','b2']]=df['b'].apply(pd.Series)
print(df)
print('----------------法二')
df=df.join(df['b'].apply(pd.Series))
print(df)

































