import pandas as pd
s=pd.DataFrame(data={
    '产品名称':['电脑','手机','键盘','鼠标','手机','键盘','鼠标','电脑'],
    '成交额':[4100,1000,100,100,800,200,50,3000],
    '成交量':[10,30,45,60,10,70,80,20]
    })
print(s)
print('------------------------               ----------------------------转字典')
s1=s.groupby('产品名称')['成交量'].sum()
mydict=s1.to_dict()
for i in mydict:
    print(i,':',mydict[i])
print('------------------------               ----------------------------转列表')
s2=s['产品名称']
a=s2.values.tolist()
print(a)
print('------------------------               ----------------------------转元组')
s3=s[['产品名称']]
t=[tuple(x) for x in s3.values]
for i in t:
    print(i)










