import pandas as pd
pd.set_option('display.unicode.east_asian_width',True)
s1=pd.DataFrame(data={
    '学号':[1001,1002,1003],
    '语文':[56,38,47],
    '数学':[88,19,70],
    '英语':[96,78,81]
})
s2=pd.DataFrame(data={
    '学号':[1001,1002,1003],
    '物理':[50,48,57]
})
print('-------------------------------------------------merge方法一对一合并')
new_s=pd.merge(s1,s2,on='学号')
print(new_s)
print('=============================================================================左连接')
s1=pd.DataFrame(data={
    '学号':[1001,1002,1003],
    '语文':[56,38,47],
    '数学':[88,19,70],
    '英语':[96,78,81]
})
s2=pd.DataFrame(data={
    '学号':[1001,1002],
    '物理':[50,48]
})
new_s=pd.merge(s1,s2,how='left',on='学号')
print(new_s)
print('=============================右连接=====================================================')
s1=pd.DataFrame(data={
    '学号':[1001,1002],
    '语文':[56,38],
    '数学':[88,19],
    '英语':[96,78]
})
s2=pd.DataFrame(data={
    '学号':[1001,1002,1003],
    '物理':[50,48,57]
})
new_s=pd.merge(s1,s2,how='right',on='学号')
print(new_s)
print('====================================内连接=====================================')
s1=pd.DataFrame(data={
    '学号':[1001,1002,1003],
    '语文':[56,38,47],
    '数学':[88,19,70],
    '英语':[96,78,81]
})
s2=pd.DataFrame(data={
    '学号':[1001,1002,1004],
    '物理':[50,48,57]
})
new_s=pd.merge(s1,s2,how='inner',on='学号')
print(new_s)
print('====================================外连接=====================================')
new_s=pd.merge(s1,s2,how='outer',on='学号')
print(new_s)






















