import pandas as pd
data=['语文','数学','英语']
s=pd.Series(data=data,index=['张三','李四','王五'])
print(s)
# 张三    语文
# 李四    数学
# 王五    英语
# dtype: object

print('-------------------------------------------------------位置索引')
print(s[1])#数学
print('-------------------------------------------------------标签索引')
print(s['李四'])#数学
print(s[['张三','王五']])
# 张三    语文
# 王五    英语
# dtype: object
print('-------------------------------------------------------切片索引')
s=pd.Series(data=data,index=['张三','李四','王五'])
print(s[0:2])#位置索引切片 含头不含尾
# 张三    语文
# 李四    数学
# dtype: object
print(s['张三':'王五'])#标签索引切片 含头含尾
# 张三    语文
# 李四    数学
# 王五    英语
# dtype: object
print('-------------------------------------------------------获取series索引和值')
print(s.values)
# ['语文' '数学' '英语']
print(s.index)
# Index(['张三', '李四', '王五'], dtype='object')