import pandas as pd
data=[[45,65,200],[89,69,42],[58,74,39]]
index=['张三','李四','王五']
col=['语文','数学','英语']
s=pd.DataFrame(data=data,index=index,columns=col)
print(s)
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print('----------------------------------------------------------------数据提取 根据标签')
print(s.loc['张三'])
# 语文     45
# 数学     65
# 英语    200
# Name: 张三, dtype: int64
print('----------------------------------------------------------------数据提取 根据序列')
print(s.iloc[0])
# 语文     45
# 数学     65
# 英语    200
# Name: 张三, dtype: int64

print('----------------------------------------------------------------数据提取 提取多行')
print(s.loc[['张三','王五']])
print(s.iloc[[0,2]])
#     语文  数学   英语
# 张三  45  65  200
# 王五  58  74   39
print('----------------------------------------------------------------数据提取 提取多行')
print(s.loc['张三':'王五'])
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print(s.iloc[0:2])#含头不含尾
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
print('----------------切片')
print(s.iloc[1::])#start:stop:step































