import pandas as pd
data=[[45,65,200],[89,69,42],[58,74,39]]
index=['张三','李四','王五']
col=['语文','数学','英语']
s=pd.DataFrame(data=data,index=index,columns=col)
print(s)
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print('---------------------------------------loc')
print(s.loc['张三','语文'])
# 45
print(s.loc[['张三','王五'],['语文','数学']])
#     语文  数学
# 张三  45  65
# 王五  58  74
print('**************连续数据')
print(s.loc['张三':'王五','语文':'英语'])#,左边行切片,右边列切片
print('---------------------------------------iloc')
print(s.iloc[0,0])
# 45
print(s.iloc[[0,2],[0,1]])
#     语文  数学
# 张三  45  65
# 王五  58  74
print('**************连续数据')
print(s.iloc[0:2,0:2])#,左边行切片,右边列切片


