import pandas as pd
data=[[45,65,200],[89,69,42],[58,74,39]]
index=['张三','李四','王五']
col=['语文','数学','英语']
s=pd.DataFrame(data=data,index=index,columns=col)
print(s)
#     语文  数学   英语
# 张三  45  65  200
# 李四  89  69   42
# 王五  58  74   39
print('----------------------------------------------------------------单个条件')
print(s['语文']>=50)
# 张三    False
# 李四     True
# 王五     True
# Name: 语文, dtype: bool
print(s.loc[s['语文']>=50])
#     语文  数学  英语
# 李四  89  69  42
# 王五  58  74  39
print('----------------------------------------------------------------多个条件')
print(s.loc[(s['语文']>=50) & (s['数学']>=65)])
